notes/notes.org
#+TITLE: Cache Optimized error correction.
#+AUTHOR:
#+EMAIL:
#+DATE:
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [integrals, nointegrals, article, 12pt, a4paper]
#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{clrscode3e}
#+LATEX_HEADER: \usepackage{palatino}
#+LATEX_HEADER: \usepackage{euler}
#+LATEX_HEADER: \setcounter{secnumdepth}{2}
#+LATEX_HEADER: \geometry{a4paper, textwidth=6.5in, textheight=10in, marginparsep=7pt, marginparwidth=.6in}
#+LaTeX_HEADER: \usepackage{amsthm}
#+LaTeX_HEADER: \newtheorem{theorem}{Theorem}[section]
#+LaTeX_HEADER: \newtheorem{lemma}[theorem]{Lemma}
#+LATEX_CMD: pdflatex
#+LATEX_EXPORT_ON_SAVE: t

* Algorithm
   We assume that the index of array and the level number starts with
   $0$.  We say a search tree /complete/, if at every level $i$ of the
   tree has exactly $m(m+1)^{i}$ elements. We also assume $n$ is a
   multiple of $m$ and $m \geq 3$.

  \begin{codebox}
  \Procname{$\proc{Cache-Aware-Search-Tree}(X, m)$}
  \zi \kw{Input : } List of Elements, $X$ ; No. of Elements in a cache line, $m$
  \zi \kw{Output : } Cache-Aware Search Tree of the list $X$ of size $n$, $CT$
  \li $l \gets \lceil \log_{m+1} (n+1) \rceil$
  \li $\proc{Init-Global}(m, l)$
  \li Initialize $CT$ as a vector of size $n$.
  \li $i \gets 0$; $CT[0] \gets 0$; $CT[1] \gets l$; $CT[m - 1] \gets n - 1$
  \li $l_{ptr} \gets 0$ \Comment Pointer to the last inserted node
  \li $c_{ptr} \gets 0$ \Comment Pointer to the current node
  \li \While $i < n$
      \Do
  \zi      \Comment $[x,y]$ range of indices covered by this subtree.
  \li      $x \gets CT[c_{ptr}]$
  \li      $y \gets CT[c_{ptr} + m - 1]$
  \zi      \Comment $k$ is no. levels of current subtree including root.
  \li      $k \gets CT[c_{ptr} + 1]$
  \li      $d \gets y - x + 1$
  \li      \If $d == m$
           \Then
  \li
  \li      $ST \gets \proc{Subtree-Size}(y - x + 1, k)$
  \li      $y \gets x$
  \li      \For $j \gets 0 \To m - 1$ \Comment Update entries for current node.
           \Do
  \li           $y \gets y + ST[j]$
  \li           $CT[c_{ptr} + j] \gets y$
           \End
  \li      \For $j \gets 0 \To m$ \Comment Insert indices for sub-trees.
           \Do
  \li           \If $ST[j] > 0$
                \Do
  \li               $y \gets x + ST[j]$
  \li               $l_{ptr} \gets l_{ptr} + m$
  \li               $CT[l_{ptr}] \gets x$
  \li               $CT[l_{ptr} + 1] \gets k - 1$
  \li               $CT[l_{ptr} + m - 1] \gets y - 1$
  \li               $x \gets y + 1$
                \End
          \End
  \li     $i = i + m$; $c_{ptr} = c_{ptr} + m$
      \End
  \li \Return $CT$
  \end{codebox}

  \begin{codebox}
  \Procname{$\proc{Init-Global}(m, l)$}
  \zi $A_1, A_2$ are global arrays of size $l$ each.
  \li Initialize $A_1$ with $A_1[i] = m(m+1)^{i}$.
  \zi \quad $A_1[i]$ is the number of elements at level $i$ of a
      complete $m$-ary search tree.
  \li Initialize $A_2$ with $A_2[i] = \sum_{j = 0}^i A_1[j]$.
  \zi \quad $A_2[i]$ is the total number of elements at upto
      level $i$ of a complete $m$-ary search tree.
  \end{codebox}

  \begin{codebox}
  \Procname{$\proc{Subtree-Size}(d,k)$}
  \zi \kw{Input : } No. of elements with in this subtree, $d$
  \zi \kw{Input : } No. of Levels in the current subtree incl. root, $k$
  \zi \kw{Output : } Size of each of the $m+1$ subtree sizes, $ST$
  \li \If $d == m$ \Comment Last row : All zeroes
  \li \Do Initialize $ST$ to $m+1$ zeros.
  \li     \Return $ST$ \End
  \li $d_k \gets d - A_2[k - 2]$ \Comment No. of elements in the last level
  \li $q = d_k / A_1[k - 2]$
  \li $r = d_k \% A_1[k - 2]$
  \zi \Comment $LS$, No. elements in last row of $m+1$ sub-trees.
  \li \For $j \gets 0 \To m$
  \li \Do \If $j < q$
  \li        \Then $LS[j] \gets A_1[k - 2]$
  \li      \ElseIf $j > q$
  \li        \Then $LS[j] \gets 0$
  \li      \Else
  \li         $LS[j] \gets r$ \End
      \End
  \zi \Comment $ST$, Size of $m+1$ sub-trees
  \li \For $j \gets 0 \To m$
  \li \Do $ST[j] = LS[j] + A_2[k-2]$ \End
  \li \Return $ST$
  \end{codebox}


* Experimental Results

In order to demonstate how the layout datastructures behave with real
datasets, we used the datasets listed in table
[[tab:datasets]]. Datasets are the same as that one used in (TODO: Refer
parallel error correction paper) and are available from the NCBI Short
Read Archive.

#+CAPTION: Datasets for experimental validation
#+NAME: tab:datasets
|---------+------------+--------------+--------------+----------|
| Dataset | Genome     | No. of Reads |  Read Length | Coverage |
|         |            |   (millions) | (base pairs) |          |
|---------+------------+--------------+--------------+----------|
| D2      | /E.Coli/   |          8.9 |          101 |     193x |
| D3A     | /Droso. M/ |         37.9 |           95 |      30x |
| D3B     | /Droso. M/ |         41.5 |           35 |      12x |
| D3C     | /Droso. M/ |         18.8 |           75 |      12x |
|---------+------------+--------------+--------------+----------|


Datasets D3A (SRX023452), D3B (SRX001651) and D3C(SRX001652) are
combined into a single dataset D3, having 98.2 million
reads. D2(SRR034501\_1) and D3 are used in all our experiments. Since we
use the same parameters as used in (TODO: refer to the error correction
paper), we don't evaluate the quality of error correction. We only
evaluate the runtime performace for error correction runs of the
datasets D2 and D3 with the three different -- sorted order layout,
cache aware layout and cache oblivious layout.



* Results
** Kmer Table Sizes

#+CAPTION: $k$-mer spectrum and tile spectrum size
#+NAME: tab:spectrum
|---------+-----------------+-----------------|
| Dataset | Kmer Table Size | Tile Table Size |
|---------+-----------------+-----------------|
| D2      |         1699218 |         8830856 |
| D3      |         6092949 |       240045877 |
|---------+-----------------+-----------------|


** Dataset D2 (Hamming Distance 1)
*** Summary

#+CAPTION: Results for dataset $D2$ with $h = 1$
#+NAME: tab:d2h1run
|-------+----------------+----------------+------------------+---------+------------------+---------|
|       |     k-Spectrum |          Error |      Cache Aware |         |  Cache Oblivious |         |
| Procs |   Construction |     Correction | Error Correction | Speedup | Error Correction | Speedup |
|       | Time (seconds) | Time (seconds) |   Time (seconds) |         |   Time (seconds) |         |
|-------+----------------+----------------+------------------+---------+------------------+---------|
|     2 |          74.94 |        1326.61 |           739.76 |   1.79x |           858.30 |   1.54x |
|     4 |          42.61 |         761.65 |           451.68 |   1.68x |           475.62 |   1.60x |
|     8 |          22.66 |         335.53 |           244.57 |   1.37x |           249.76 |   1.34x |
|    16 |          13.12 |         189.28 |           133.60 |   1.41x |           130.01 |   1.44x |
|    32 |           7.71 |          98.92 |            71.72 |   1.38x |            69.10 |   1.43x |
|    64 |           4.90 |          52.46 |            36.42 |   1.46x |            35.79 |   1.46x |
|   128 |           4.24 |          28.02 |            19.71 |   1.42x |            19.23 |   1.45x |
|   256 |           5.90 |          14.25 |            10.40 |   1.37x |            10.06 |   1.42x |
|   512 |          13.72 |           7.65 |             5.60 |   1.37x |             5.54 |   1.38x |
|-------+----------------+----------------+------------------+---------+------------------+---------|



