notes/notes.tex
% Created 2015-06-13 Sat 17:49
\documentclass[integrals, nointegrals, article, 12pt, a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{geometry}
\usepackage{amsmath}
\usepackage{clrscode3e}
\usepackage{palatino}
\usepackage{euler}
\setcounter{secnumdepth}{2}
\geometry{a4paper, textwidth=6.5in, textheight=10in, marginparsep=7pt, marginparwidth=.6in}
\usepackage{amsthm}
\newtheorem{theorem}{Theorem}[section]
\newtheorem{lemma}[theorem]{Lemma}
\date{}
\title{Cache Optimized error correction.}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.8)}}
\begin{document}

\maketitle

\section{Algorithm}
\label{sec-1}
We assume that the index of array and the level number starts with
$0$.  We say a search tree \emph{complete}, if at every level $i$ of the
tree has exactly $m(m+1)^{i}$ elements. We also assume $n$ is a
multiple of $m$ and $m \geq 3$.

\begin{codebox}
\Procname{$\proc{Cache-Aware-Search-Tree}(X, m)$}
\zi \kw{Input : } List of Elements, $X$ ; No. of Elements in a cache line, $m$
\zi \kw{Output : } Cache-Aware Search Tree of the list $X$ of size $n$, $CT$
\li $l \gets \lceil \log_{m+1} (n+1) \rceil$
\li $\proc{Init-Global}(m, l)$
\li Initialize $CT$ as a vector of size $n$.
\li $i \gets 0$; $CT[0] \gets 0$; $CT[1] \gets l$; $CT[m - 1] \gets n - 1$
\li $l_{ptr} \gets 0$ \Comment Pointer to the last inserted node
\li $c_{ptr} \gets 0$ \Comment Pointer to the current node
\li \While $i < n$
    \Do
\zi      \Comment $[x,y]$ range of indices covered by this subtree.
\li      $x \gets CT[c_{ptr}]$
\li      $y \gets CT[c_{ptr} + m - 1]$
\zi      \Comment $k$ is no. levels of current subtree including root.
\li      $k \gets CT[c_{ptr} + 1]$
\li      $d \gets y - x + 1$
\li      \If $d == m$
         \Then
\li
\li      $ST \gets \proc{Subtree-Size}(y - x + 1, k)$
\li      $y \gets x$
\li      \For $j \gets 0 \To m - 1$ \Comment Update entries for current node.
         \Do
\li           $y \gets y + ST[j]$
\li           $CT[c_{ptr} + j] \gets y$
         \End
\li      \For $j \gets 0 \To m$ \Comment Insert indices for sub-trees.
         \Do
\li           \If $ST[j] > 0$
              \Do
\li               $y \gets x + ST[j]$
\li               $l_{ptr} \gets l_{ptr} + m$
\li               $CT[l_{ptr}] \gets x$
\li               $CT[l_{ptr} + 1] \gets k - 1$
\li               $CT[l_{ptr} + m - 1] \gets y - 1$
\li               $x \gets y + 1$
              \End
        \End
\li     $i = i + m$; $c_{ptr} = c_{ptr} + m$
    \End
\li \Return $CT$
\end{codebox}

\begin{codebox}
\Procname{$\proc{Init-Global}(m, l)$}
\zi $A_1, A_2$ are global arrays of size $l$ each.
\li Initialize $A_1$ with $A_1[i] = m(m+1)^{i}$.
\zi \quad $A_1[i]$ is the number of elements at level $i$ of a
    complete $m$-ary search tree.
\li Initialize $A_2$ with $A_2[i] = \sum_{j = 0}^i A_1[j]$.
\zi \quad $A_2[i]$ is the total number of elements at upto
    level $i$ of a complete $m$-ary search tree.
\end{codebox}

\begin{codebox}
\Procname{$\proc{Subtree-Size}(d,k)$}
\zi \kw{Input : } No. of elements with in this subtree, $d$
\zi \kw{Input : } No. of Levels in the current subtree incl. root, $k$
\zi \kw{Output : } Size of each of the $m+1$ subtree sizes, $ST$
\li \If $d == m$ \Comment Last row : All zeroes
\li \Do Initialize $ST$ to $m+1$ zeros.
\li     \Return $ST$ \End
\li $d_k \gets d - A_2[k - 2]$ \Comment No. of elements in the last level
\li $q = d_k / A_1[k - 2]$
\li $r = d_k \% A_1[k - 2]$
\zi \Comment $LS$, No. elements in last row of $m+1$ sub-trees.
\li \For $j \gets 0 \To m$
\li \Do \If $j < q$
\li        \Then $LS[j] \gets A_1[k - 2]$
\li      \ElseIf $j > q$
\li        \Then $LS[j] \gets 0$
\li      \Else
\li         $LS[j] \gets r$ \End
    \End
\zi \Comment $ST$, Size of $m+1$ sub-trees
\li \For $j \gets 0 \To m$
\li \Do $ST[j] = LS[j] + A_2[k-2]$ \End
\li \Return $ST$
\end{codebox}


\section{Experimental Results}
\label{sec-2}

In order to demonstate how the layout datastructures behave with real
datasets, we used the datasets listed in table
\ref{tab:datasets}. Datasets are the same as that one used in (TODO: Refer
parallel error correction paper) and are available from the NCBI Short
Read Archive.

\begin{table}[htb]
\caption{\label{tab:datasets}Datasets for experimental validation}
\centering
\begin{tabular}{llrrr}
\hline
Dataset & Genome & No. of Reads & Read Length & Coverage\\
 &  & (millions) & (base pairs) & \\
\hline
D2 & \emph{E.Coli} & 8.9 & 101 & 193x\\
D3A & \emph{Droso. M} & 37.9 & 95 & 30x\\
D3B & \emph{Droso. M} & 41.5 & 35 & 12x\\
D3C & \emph{Droso. M} & 18.8 & 75 & 12x\\
\hline
\end{tabular}
\end{table}


Datasets D3A (SRX023452), D3B (SRX001651) and D3C(SRX001652) are
combined into a single dataset D3, having 98.2 million
reads. D2(SRR034501$\backslash$$_{\text{1}}$) and D3 are used in all our experiments. Since we
use the same parameters as used in (TODO: refer to the error correction
paper), we don't evaluate the quality of error correction. We only
evaluate the runtime performace for error correction runs of the
datasets D2 and D3 with the three different -- sorted order layout,
cache aware layout and cache oblivious layout.



\section{Results}
\label{sec-3}
\subsection{Kmer Table Sizes}
\label{sec-3-1}

\begin{table}[htb]
\caption{\label{tab:spectrum}$k$-mer spectrum and tile spectrum size}
\centering
\begin{tabular}{lrr}
\hline
Dataset & Kmer Table Size & Tile Table Size\\
\hline
D2 & 1699218 & 8830856\\
D3 & 6092949 & 240045877\\
\hline
\end{tabular}
\end{table}


\subsection{Dataset D2 (Hamming Distance 1)}
\label{sec-3-2}
\subsubsection{Summary}
\label{sec-3-2-1}

\begin{table}[htb]
\caption{\label{tab:d2h1run}Results for dataset $D2$ with $h = 1$}
\centering
\begin{tabular}{rrrrrrr}
\hline
 & k-Spectrum & Error & Cache Aware &  & Cache Oblivious & \\
Procs & Construction & Correction & Error Correction & Speedup & Error Correction & Speedup\\
 & Time (seconds) & Time (seconds) & Time (seconds) &  & Time (seconds) & \\
\hline
2 & 74.94 & 1326.61 & 739.76 & 1.79x & 858.30 & 1.54x\\
4 & 42.61 & 761.65 & 451.68 & 1.68x & 475.62 & 1.60x\\
8 & 22.66 & 335.53 & 244.57 & 1.37x & 249.76 & 1.34x\\
16 & 13.12 & 189.28 & 133.60 & 1.41x & 130.01 & 1.44x\\
32 & 7.71 & 98.92 & 71.72 & 1.38x & 69.10 & 1.43x\\
64 & 4.90 & 52.46 & 36.42 & 1.46x & 35.79 & 1.46x\\
128 & 4.24 & 28.02 & 19.71 & 1.42x & 19.23 & 1.45x\\
256 & 5.90 & 14.25 & 10.40 & 1.37x & 10.06 & 1.42x\\
512 & 13.72 & 7.65 & 5.60 & 1.37x & 5.54 & 1.38x\\
\hline
\end{tabular}
\end{table}
