notes/notes.org
*** Default run results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|     2 |          74.94 |          1326.61 |        1406.62 |
|     4 |          42.61 |           761.65 |         808.91 |
|     8 |          22.66 |           335.53 |         359.56 |
|    16 |          13.12 |           189.28 |         203.14 |
|    32 |           7.71 |            98.92 |         107.12 |
|    64 |           4.90 |            52.46 |          57.59 |
|   128 |           4.24 |            28.02 |          32.40 |
|   256 |           5.90 |            14.25 |          20.37 |
|   512 |          13.72 |             7.65 |          22.10 |
|-------+----------------+------------------+----------------|


*** Cache Aware results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|     2 |          68.32 |           739.76 |         813.68 |
|     4 |          37.69 |           451.68 |         491.88 |
|     8 |          22.65 |           244.57 |         268.59 |
|    16 |          12.12 |           133.60 |         147.47 |
|    32 |           7.60 |            71.72 |          80.82 |
|    64 |           4.90 |            36.42 |          41.51 |
|   128 |           4.10 |            19.71 |          24.77 |
|   256 |           5.80 |            10.40 |          16.80 |
|   512 |          13.10 |             5.60 |          19.52 |
|-------+----------------+------------------+----------------|

*** Cache Oblivious results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|     2 |          75.24 |           858.30 |         948.21 |
|     4 |          42.07 |           475.62 |         520.45 |
|     8 |          23.65 |           249.76 |         274.82 |
|    16 |          13.14 |           130.01 |         147.21 |
|    32 |           7.65 |            69.10 |          77.21 |
|    64 |           4.72 |            35.79 |          40.83 |
|   128 |           4.38 |            19.23 |          23.14 |
|   256 |           6.36 |            10.06 |          16.49 |
|   512 |          13.34 |             5.54 |          19.61 |
|-------+----------------+------------------+----------------|

** Dataset D2 (Hamming Distance = 2)

*** Summary

#+CAPTION: Results for dataset $D2$ with $h = 1$
#+NAME: tab:d2h1run
|-------+----------------+----------------+------------------+---------+------------------+---------|
|       |     k-Spectrum |          Error |      Cache Aware |         |  Cache Oblivious |         |
| Procs |   Construction |     Correction | Error Correction | Speedup | Error Correction | Speedup |
|       | Time (seconds) | Time (seconds) |   Time (seconds) |         |   Time (seconds) |         |
|-------+----------------+----------------+------------------+---------+------------------+---------|
|    64 |           4.79 |        5820.63 |          2430.41 |    2.39 |          3430.27 |    1.69 |
|   128 |           4.06 |        2868.85 |          1315.91 |    2.18 |          1819.92 |    1.57 |
|   256 |           6.19 |        1627.04 |           740.60 |    2.19 |          1042.59 |    1.56 |
|   512 |          13.06 |         835.94 |           380.16 |    2.19 |           537.66 |    1.55 |
|-------+----------------+----------------+------------------+---------+------------------+---------|

*** Default run results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|    64 |           4.79 |          5820.63 |        5287.87 |
|   128 |           4.06 |          2868.85 |        2874.39 |
|   256 |           6.19 |          1627.04 |        1693.27 |
|   512 |          13.06 |           835.94 |         908.36 |
|-------+----------------+------------------+----------------|

*** Cache Aware results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|    64 |           4.83 |          2430.41 |        2495.45 |
|   128 |           4.10 |          1315.91 |        1321.59 |
|   256 |           5.86 |           740.60 |         747.63 |
|   512 |           14.1 |           380.16 |         394.61 |
|-------+----------------+------------------+----------------|

*** Cache Oblivious results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|    64 |           4.80 |          3430.27 |        3435.68 |
|   128 |           4.07 |          1819.92 |        1825.67 |
|   256 |           6.83 |          1042.59 |        1050.28 |
|   512 |          13.01 |           537.66 |         551.67 |
|-------+----------------+------------------+----------------|

** Dataset D3 (Hamming Distance 1)
*** Default run results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|     8 |         742.81 |          1393.49 |        2161.24 |
|    16 |         301.14 |           909.75 |        1242.94 |
|    32 |          95.42 |           521.19 |         622.65 |
|    64 |          56.96 |           268.58 |         328.34 |
|   128 |          36.03 |           139.88 |         177.49 |
|   256 |          27.98 |            89.03 |         117.85 |
|   512 |          32.55 |            53.81 |          87.44 |
|-------+----------------+------------------+----------------|

*** Cache Aware results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|     8 |                |                  |                |
|    16 |         325.56 |           597.92 |         959.25 |
|    32 |          95.07 |           339.56 |         440.89 |
|    64 |          56.71 |           177.45 |         237.06 |
|   128 |          36.47 |            95.91 |         133.95 |
|   256 |          27.65 |            57.54 |          85.99 |
|   512 |          31.31 |            36.12 |          68.50 |
|-------+----------------+------------------+----------------|

*** Cache Oblivious results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|     8 |                |                  |                |
|    16 |         277.21 |           591.01 |         895.64 |
|    32 |          95.85 |           343.65 |         442.24 |
|    64 |          56.62 |           175.89 |         241.81 |
|   128 |          36.34 |            93.65 |         135.92 |
|   256 |          28.24 |            60.75 |          89.78 |
|   512 |          31.28 |            47.29 |          81.26 |
|-------+----------------+------------------+----------------|

** Dataset D3 (Hamming Distance = 2)
*** Summary
#+CAPTION: Results for dataset $D3$ with $h = 2$
#+NAME: tab:d3h2run
|-------+----------------+----------------+------------------+---------+------------------+---------|
|       |     k-Spectrum |          Error |      Cache Aware |         |  Cache Oblivious |         |
| Procs |   Construction |     Correction | Error Correction | Speedup | Error Correction | Speedup |
|       | Time (seconds) | Time (seconds) |   Time (seconds) |         |   Time (seconds) |         |
|-------+----------------+----------------+------------------+---------+------------------+---------|
|   256 |          27.49 |        5816.80 |          2633.96 |    2.21 |          3600.86 |    1.61 |
|   512 |          33.04 |        3503.59 |          1611.09 |    2.17 |          2184.29 |    1.60 |
|  1024 |          53.40 |        2156.35 |          1071.46 |    2.01 |          1313.32 |    1.64 |
|-------+----------------+----------------+------------------+---------+------------------+---------|

*** Default run results

|-------+----------------+------------------+----------------|
| Procs |   Construction | Error Correction |          Total |
|       | Time (seconds) |   Time (seconds) | Time (seconds) |
|-------+----------------+------------------+----------------|
|   256 |          27.49 |          5816.80 |        5865.32 |
|   512 |          33.04 |          3503.59 |        3544.15 |
|  1024 |          53.40 |          2156.35 |        2215.19 |
|-------+----------------+------------------+----------------|

